# лень кидать в zip реализую 2 функции, асинхронными их делать бессмысленно


def task_1():
    data_list = ['1', 2, True, '3', 4, False, '5', 6, True, '7']
    print(f'Список: {data_list}')
    print(f'Первые 5 элементов {data_list[:5]}')
    print(f'Последние 3 элемента {data_list[-3:]}')
    print(f'Каждый 2 элемент {data_list[1::2]}')
    data_list[2] = 'Это больше не True'
    print(f'Новый список: {data_list}')


# Задание два называется работа с условиями и циклами прикольно когда тема по
# спискам а задание из предыдущей темы и следующей
# я так и не понял в какой момент использовать цикл сделаю обработку неверно ведённго числа через него
def task_2():
    num1 = input('Введите число: ')
    while not num1.isdigit():
        print('ERROR! Это не число.')
        num1 = input('Введите число: ')
    if int(num1) % 2 == 0:
        print('Число чётное')
    else:
        print('Число нечётное')

    num1 = input('Введите число: ')
    while not num1.isdigit():
        print('ERROR! Это не число.')
        num1 = input('Введите число: ')
    if int(num1) % 3 == 0:
        print('Число делится на 3')
    elif int(num1) > 10:
        print('Число больше 10')
    else:
        print('Число не соответствует условиям')


if __name__ == '__main__':
    task_1()
    task_2()

# По таске комментарии не обязательны ==> их нет
# код по стандарту PEP8 в таких программах flake8 бессмысленно юзать
